Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Hash_CustomCrcImport.Text
source: Import...
ar: استيراد...
cs: Importovat...
de: Importieren...
el: Εισαγωγή...
es: Importar...
fa: وارد کردن...
fr: Importer...
hu: Importálás...
id: Impor...
it: Importa...
ja: インポート...
ko: 가져오기...
pl: Importuj...
pt: Importar...
ro: Importare...
th: นำเข้า...
tr: İçeri aktar...
uk: Імпортувати...
vi: Nhập...
zh_hans: 导入...
zh_hant: 匯入...

# Hash_CustomCrcDelete.Text
source: Delete
ar: حذف
cs: Odstranit
de: Löschen
el: Διαγραφή
es: Eliminar
fa: حذف
fr: Supprimer
hu: Törlés
id: Hapus
it: Elimina
ja: 削除
ko: 삭제
pl: Usuń
pt: Excluir
ro: Ștergere
th: ลบ
tr: Sil
uk: Видалити
vi: Xóa
zh_hans: 删除
zh_hant: 刪除

# Hash_WriteAtCursor.Text
source: Write at cursor...
ar: الكتابة عند المؤشر...
cs: Zapsat na pozici kurzoru...
de: Am Cursor schreiben...
el: Εγγραφή στη θέση του δρομέα...
es: Escribir en el cursor...
fa: نوشتن در محل مکان‌نما...
fr: Écrire au curseur...
hu: Írás a kurzorhoz...
id: Tulis di kursor...
it: Scrivi al cursore...
ja: カーソル位置に書き込む...
ko: 커서 위치에 쓰기...
pl: Zapisz w miejscu kursora...
pt: Gravar no cursor...
ro: Scriere la cursor...
th: เขียนที่เคอร์เซอร์...
tr: İmlece yaz...
uk: Записати в позицію курсора...
vi: Ghi tại con trỏ...
zh_hans: 在光标处写入...
zh_hant: 在游標處寫入...

# Hash_FindAlgorithm.Content
source: Find matching algorithm
ar: البحث عن الخوارزمية المطابقة
cs: Najít odpovídající algoritmus
de: Passenden Algorithmus suchen
el: Εύρεση αλγορίθμου που ταιριάζει
es: Buscar el algoritmo coincidente
fa: یافتن الگوریتم منطبق
fr: Rechercher l'algorithme correspondant
hu: Egyező algoritmus keresése
id: Temukan algoritme yang cocok
it: Trova algoritmo corrispondente
ja: 一致するアルゴリズムを探す
ko: 일치하는 알고리즘 찾기
pl: Znajdź pasujący algorytm
pt: Localizar algoritmo correspondente
ro: Găsire algoritm corespunzător
th: ค้นหาอัลกอริทึมที่ตรงกัน
tr: Eşleşen algoritmayı bul
uk: Знайти відповідний алгоритм
vi: Tìm thuật toán khớp
zh_hans: 查找匹配的算法
zh_hant: 尋找相符的演算法

# Hash_FindRun
source: Search
ar: بحث
cs: Hledat
de: Suchen
el: Αναζήτηση
es: Buscar
fa: جستجو
fr: Rechercher
hu: Keresés
id: Cari
it: Cerca
ja: 探す
ko: 검색
pl: Szukaj
pt: Pesquisar
ro: Căutare
th: ค้นหา
tr: Ara
uk: Знайти
vi: Tìm
zh_hans: 搜索
zh_hant: 搜尋

# Hash_FindConfirm
source: This calculates every algorithm of the same length. It takes about {0} seconds.
ar: يحسب هذا كل خوارزمية بالطول نفسه. يستغرق نحو {0} ثانية.
cs: Vypočítá se každý algoritmus se stejnou délkou. Potrvá to asi {0} s.
de: Dabei wird jeder Algorithmus gleicher Länge berechnet. Das dauert etwa {0} Sekunden.
el: Υπολογίζεται κάθε αλγόριθμος του ίδιου μήκους. Διαρκεί περίπου {0} δευτερόλεπτα.
es: Esto calcula todos los algoritmos de la misma longitud. Tarda unos {0} segundos.
fa: این کار همهٔ الگوریتم‌های هم‌طول را محاسبه می‌کند. حدود {0} ثانیه طول می‌کشد.
fr: Cela calcule tous les algorithmes de même longueur. Cela prend environ {0} secondes.
hu: Ez minden azonos hosszúságú algoritmust kiszámít. Körülbelül {0} másodpercig tart.
id: Ini menghitung setiap algoritme dengan panjang yang sama. Membutuhkan sekitar {0} detik.
it: Verranno calcolati tutti gli algoritmi della stessa lunghezza. Richiede circa {0} secondi.
ja: 長さが同じすべてのアルゴリズムで計算します。約 {0} 秒かかります。
ko: 길이가 같은 모든 알고리즘으로 계산합니다. 약 {0}초 걸립니다.
pl: Zostaną obliczone wszystkie algorytmy o tej samej długości. Potrwa to około {0} s.
pt: Isso calcula todos os algoritmos do mesmo comprimento. Leva cerca de {0} segundos.
ro: Se calculează toți algoritmii cu aceeași lungime. Durează aproximativ {0} secunde.
th: การดำเนินการนี้จะคำนวณทุกอัลกอริทึมที่มีความยาวเท่ากัน ใช้เวลาประมาณ {0} วินาที
tr: Bu işlem aynı uzunluktaki her algoritmayı hesaplar. Yaklaşık {0} saniye sürer.
uk: Буде обчислено всі алгоритми тієї самої довжини. Це триватиме приблизно {0} с.
vi: Thao tác này tính mọi thuật toán có cùng độ dài. Mất khoảng {0} giây.
zh_hans: 这将计算所有相同长度的算法，大约需要 {0} 秒。
zh_hant: 這會計算所有相同長度的演算法，大約需要 {0} 秒。

# Hash_FindNeedsExpected
source: Enter the expected value first.
ar: أدخل القيمة المتوقعة أولاً.
cs: Nejprve zadejte očekávanou hodnotu.
de: Geben Sie zuerst den erwarteten Wert ein.
el: Εισαγάγετε πρώτα την αναμενόμενη τιμή.
es: Escribe primero el valor esperado.
fa: ابتدا مقدار مورد انتظار را وارد کنید.
fr: Entrez d'abord la valeur attendue.
hu: Előbb adja meg a várt értéket.
id: Masukkan nilai yang diharapkan terlebih dahulu.
it: Immetti prima il valore previsto.
ja: 先に期待値を入力してください。
ko: 먼저 예상 값을 입력하세요.
pl: Najpierw wprowadź oczekiwaną wartość.
pt: Insira primeiro o valor esperado.
ro: Introduceți mai întâi valoarea așteptată.
th: ป้อนค่าที่คาดหวังก่อน
tr: Önce beklenen değeri girin.
uk: Спочатку введіть очікуване значення.
vi: Hãy nhập giá trị mong đợi trước.
zh_hans: 请先输入预期值。
zh_hant: 請先輸入預期值。

# Hash_Finding
source: Searching...
ar: جارٍ البحث...
cs: Hledání...
de: Wird gesucht...
el: Αναζήτηση...
es: Buscando...
fa: در حال جستجو...
fr: Recherche...
hu: Keresés...
id: Mencari...
it: Ricerca in corso...
ja: 探しています...
ko: 검색하는 중...
pl: Wyszukiwanie...
pt: Pesquisando...
ro: Se caută...
th: กำลังค้นหา...
tr: Aranıyor...
uk: Пошук...
vi: Đang tìm...
zh_hans: 正在搜索...
zh_hant: 正在搜尋...

# Hash_FindNone
source: No algorithm matches ({0} tried).
ar: لا توجد خوارزمية مطابقة (تمت تجربة {0}).
cs: Žádný algoritmus neodpovídá (vyzkoušeno: {0}).
de: Kein Algorithmus passt ({0} getestet).
el: Κανένας αλγόριθμος δεν ταιριάζει (δοκιμάστηκαν {0}).
es: Ningún algoritmo coincide (se probaron {0}).
fa: هیچ الگوریتمی منطبق نیست ({0} مورد آزموده شد).
fr: Aucun algorithme ne correspond ({0} essayés).
hu: Egyik algoritmus sem egyezik ({0} kipróbálva).
id: Tidak ada algoritme yang cocok ({0} dicoba).
it: Nessun algoritmo corrisponde ({0} provati).
ja: 一致するアルゴリズムはありません ({0} 種類を試しました)。
ko: 일치하는 알고리즘이 없습니다({0}개 시도).
pl: Żaden algorytm nie pasuje (sprawdzono: {0}).
pt: Nenhum algoritmo corresponde ({0} testados).
ro: Niciun algoritm nu corespunde (încercați: {0}).
th: ไม่มีอัลกอริทึมที่ตรงกัน (ลองแล้ว {0})
tr: Eşleşen algoritma yok ({0} denendi).
uk: Відповідних алгоритмів немає (перевірено: {0}).
vi: Không có thuật toán nào khớp (đã thử {0}).
zh_hans: 没有匹配的算法（已尝试 {0} 种）。
zh_hant: 沒有相符的演算法（已嘗試 {0} 種）。

# Hash_FindFound
source: Matches: {0} ({1} tried).
ar: المطابقات: {0} (تمت تجربة {1}).
cs: Shody: {0} (vyzkoušeno: {1}).
de: Treffer: {0} ({1} getestet).
el: Αντιστοιχίες: {0} (δοκιμάστηκαν {1}).
es: Coincidencias: {0} (se probaron {1}).
fa: موارد منطبق: {0} ({1} مورد آزموده شد).
fr: Correspondances : {0} ({1} essayés).
hu: Egyezés: {0} ({1} kipróbálva).
id: Cocok: {0} ({1} dicoba).
it: Corrispondenze: {0} ({1} provati).
ja: 一致: {0} ({1} 種類を試しました)。
ko: 일치: {0}({1}개 시도).
pl: Dopasowania: {0} (sprawdzono: {1}).
pt: Correspondências: {0} ({1} testados).
ro: Corespund: {0} (încercați: {1}).
th: ตรงกัน: {0} (ลองแล้ว {1})
tr: Eşleşenler: {0} ({1} denendi).
uk: Збіги: {0} (перевірено: {1}).
vi: Khớp: {0} (đã thử {1}).
zh_hans: 匹配：{0}（已尝试 {1} 种）。
zh_hant: 相符：{0}（已嘗試 {1} 種）。

# Hash_FindReversed
source: {0} (byte order reversed)
ar: {0} (ترتيب البايتات معكوس)
cs: {0} (obrácené pořadí bajtů)
de: {0} (Bytereihenfolge umgekehrt)
el: {0} (αντίστροφη σειρά byte)
es: {0} (orden de bytes invertido)
fa: {0} (ترتیب بایت وارونه)
fr: {0} (ordre des octets inversé)
hu: {0} (fordított bájtsorrend)
id: {0} (urutan byte terbalik)
it: {0} (ordine dei byte invertito)
ja: {0} (バイト順が逆)
ko: {0}(바이트 순서 반대)
pl: {0} (odwrócona kolejność bajtów)
pt: {0} (ordem dos bytes invertida)
ro: {0} (ordinea octeților inversată)
th: {0} (ลำดับไบต์กลับด้าน)
tr: {0} (bayt sırası ters)
uk: {0} (зворотний порядок байтів)
vi: {0} (thứ tự byte đảo ngược)
zh_hans: {0}（字节顺序相反）
zh_hant: {0}（位元組順序相反）

# Hash_Slow
source: Slow: the overall speed is limited by this algorithm.
ar: بطيئة: السرعة الإجمالية محدودة بهذه الخوارزمية.
cs: Pomalé: celková rychlost je omezena tímto algoritmem.
de: Langsam: Die Gesamtgeschwindigkeit wird durch diesen Algorithmus begrenzt.
el: Αργός: η συνολική ταχύτητα περιορίζεται από αυτόν τον αλγόριθμο.
es: Lento: este algoritmo limita la velocidad general.
fa: کند: سرعت کلی توسط این الگوریتم محدود می‌شود.
fr: Lent : la vitesse globale est limitée par cet algorithme.
hu: Lassú: a teljes sebességet ez az algoritmus korlátozza.
id: Lambat: kecepatan keseluruhan dibatasi oleh algoritme ini.
it: Lento: la velocità complessiva è limitata da questo algoritmo.
ja: 遅いアルゴリズムです。全体の速度はこのアルゴリズムで決まります。
ko: 느림: 전체 속도가 이 알고리즘에 의해 제한됩니다.
pl: Wolny: ten algorytm ogranicza ogólną szybkość.
pt: Lento: a velocidade geral é limitada por este algoritmo.
ro: Lent: viteza totală este limitată de acest algoritm.
th: ช้า: ความเร็วโดยรวมถูกจำกัดโดยอัลกอริทึมนี้
tr: Yavaş: genel hız bu algoritma tarafından sınırlanıyor.
uk: Повільно: загальну швидкість обмежує цей алгоритм.
vi: Chậm: tốc độ tổng thể bị giới hạn bởi thuật toán này.
zh_hans: 较慢：整体速度受此算法限制。
zh_hant: 速度慢：整體速度受限於此演算法。

# Hash_SignedValue
source: Signed: {0}
ar: بإشارة: {0}
cs: Se znaménkem: {0}
de: Mit Vorzeichen: {0}
el: Με πρόσημο: {0}
es: Con signo: {0}
fa: علامت‌دار: {0}
fr: Signé : {0}
hu: Előjeles: {0}
id: Bertanda: {0}
it: Con segno: {0}
ja: 符号付き: {0}
ko: 부호 있음: {0}
pl: Ze znakiem: {0}
pt: Com sinal: {0}
ro: Cu semn: {0}
th: มีเครื่องหมาย: {0}
tr: İşaretli: {0}
uk: Зі знаком: {0}
vi: Có dấu: {0}
zh_hans: 有符号：{0}
zh_hant: 帶正負號：{0}

# Hash_ParameterError_KeyLength
source: The key length is not valid for this algorithm.
ar: طول المفتاح غير صالح لهذه الخوارزمية.
cs: Délka klíče není pro tento algoritmus platná.
de: Die Schlüssellänge ist für diesen Algorithmus ungültig.
el: Το μήκος κλειδιού δεν είναι έγκυρο για αυτόν τον αλγόριθμο.
es: La longitud de la clave no es válida para este algoritmo.
fa: طول کلید برای این الگوریتم معتبر نیست.
fr: La longueur de la clé n'est pas valide pour cet algorithme.
hu: A kulcs hossza érvénytelen ehhez az algoritmushoz.
id: Panjang kunci tidak valid untuk algoritme ini.
it: La lunghezza della chiave non è valida per questo algoritmo.
ja: 鍵の長さがこのアルゴリズムに合いません。
ko: 키 길이가 이 알고리즘에 맞지 않습니다.
pl: Długość klucza jest nieprawidłowa dla tego algorytmu.
pt: O comprimento da chave não é válido para este algoritmo.
ro: Lungimea cheii nu este validă pentru acest algoritm.
th: ความยาวคีย์ไม่ถูกต้องสำหรับอัลกอริทึมนี้
tr: Anahtar uzunluğu bu algoritma için geçerli değil.
uk: Неприпустима довжина ключа для цього алгоритму.
vi: Độ dài khóa không hợp lệ với thuật toán này.
zh_hans: 密钥长度不适用于此算法。
zh_hant: 金鑰長度不適用於此演算法。

# Hash_ParameterError_OutputLength
source: The output length is not valid for this algorithm.
ar: طول الإخراج غير صالح لهذه الخوارزمية.
cs: Délka výstupu není pro tento algoritmus platná.
de: Die Ausgabelänge ist für diesen Algorithmus ungültig.
el: Το μήκος εξόδου δεν είναι έγκυρο για αυτόν τον αλγόριθμο.
es: La longitud de salida no es válida para este algoritmo.
fa: طول خروجی برای این الگوریتم معتبر نیست.
fr: La longueur de sortie n'est pas valide pour cet algorithme.
hu: A kimeneti hossz érvénytelen ehhez az algoritmushoz.
id: Panjang output tidak valid untuk algoritme ini.
it: La lunghezza dell'output non è valida per questo algoritmo.
ja: 出力長がこのアルゴリズムに合いません。
ko: 출력 길이가 이 알고리즘에 맞지 않습니다.
pl: Długość wyniku jest nieprawidłowa dla tego algorytmu.
pt: O comprimento da saída não é válido para este algoritmo.
ro: Lungimea de ieșire nu este validă pentru acest algoritm.
th: ความยาวเอาต์พุตไม่ถูกต้องสำหรับอัลกอริทึมนี้
tr: Çıktı uzunluğu bu algoritma için geçerli değil.
uk: Неприпустима довжина результату для цього алгоритму.
vi: Độ dài đầu ra không hợp lệ với thuật toán này.
zh_hans: 输出长度不适用于此算法。
zh_hant: 輸出長度不適用於此演算法。

# Hash_ParameterError_SeedRange
source: The seed is out of range for this algorithm (0 to 0xFFFFFFFF).
ar: البذرة خارج النطاق لهذه الخوارزمية (من 0 إلى 0xFFFFFFFF).
cs: Počáteční hodnota (seed) je pro tento algoritmus mimo rozsah (0 až 0xFFFFFFFF).
de: Der Startwert liegt außerhalb des Bereichs dieses Algorithmus (0 bis 0xFFFFFFFF).
el: Ο σπόρος είναι εκτός εύρους για αυτόν τον αλγόριθμο (0 έως 0xFFFFFFFF).
es: La semilla está fuera del rango de este algoritmo (de 0 a 0xFFFFFFFF).
fa: بذر برای این الگوریتم خارج از محدوده است (0 تا 0xFFFFFFFF).
fr: La valeur initiale est hors de la plage de cet algorithme (0 à 0xFFFFFFFF).
hu: A kezdőérték kívül esik az algoritmus tartományán (0 – 0xFFFFFFFF).
id: Seed di luar rentang untuk algoritme ini (0 hingga 0xFFFFFFFF).
it: Il seed è fuori intervallo per questo algoritmo (da 0 a 0xFFFFFFFF).
ja: シードがこのアルゴリズムの範囲 (0〜0xFFFFFFFF) を超えています。
ko: 시드가 이 알고리즘의 범위(0~0xFFFFFFFF)를 벗어났습니다.
pl: Ziarno jest poza zakresem dla tego algorytmu (od 0 do 0xFFFFFFFF).
pt: A semente está fora do intervalo para este algoritmo (0 a 0xFFFFFFFF).
ro: Valoarea inițială este în afara intervalului pentru acest algoritm (0 – 0xFFFFFFFF).
th: ค่าซีดอยู่นอกช่วงสำหรับอัลกอริทึมนี้ (0 ถึง 0xFFFFFFFF)
tr: Tohum değeri bu algoritma için aralık dışında (0 ile 0xFFFFFFFF).
uk: Початкове значення поза діапазоном для цього алгоритму (від 0 до 0xFFFFFFFF).
vi: Giá trị seed nằm ngoài phạm vi của thuật toán này (0 đến 0xFFFFFFFF).
zh_hans: 种子超出此算法的范围（0 到 0xFFFFFFFF）。
zh_hant: 種子超出此演算法的範圍（0 到 0xFFFFFFFF）。

# Hash_Endian
source: Word byte order
ar: ترتيب بايتات الكلمة
cs: Pořadí bajtů slov
de: Bytereihenfolge der Wörter
el: Σειρά byte λέξεων
es: Orden de bytes de las palabras
fa: ترتیب بایت کلمه
fr: Boutisme des mots
hu: Szavak bájtsorrendje
id: Urutan byte word
it: Ordine dei byte delle word
ja: ワードのエンディアン
ko: 워드 바이트 순서
pl: Kolejność bajtów słów
pt: Ordem dos bytes das palavras
ro: Ordinea octeților în cuvinte
th: ลำดับไบต์ของเวิร์ด
tr: Sözcük bayt sırası
uk: Порядок байтів у словах
vi: Thứ tự byte của word
zh_hans: 字的字节序
zh_hant: 字組位元組順序

# Hash_Endian_Default
source: Default
ar: الافتراضي
cs: Výchozí
de: Standard
el: Προεπιλογή
es: Predeterminado
fa: پیش‌فرض
fr: Par défaut
hu: Alapértelmezett
it: Predefinito
ja: 既定
ko: 기본값
pl: Domyślna
pt: Padrão
ro: Implicit
th: ค่าเริ่มต้น
tr: Varsayılan
uk: Стандартний
vi: Mặc định
zh_hans: 默认
zh_hant: 預設

# Hash_Signed
source: Signed words
ar: كلمات بإشارة
cs: Slova se znaménkem
de: Wörter mit Vorzeichen
el: Λέξεις με πρόσημο
es: Palabras con signo
fa: کلمه‌های علامت‌دار
fr: Mots signés
hu: Előjeles szavak
id: Word bertanda
it: Word con segno
ja: 符号あり
ko: 부호 있는 워드
pl: Słowa ze znakiem
pt: Palavras com sinal
ro: Cuvinte cu semn
th: เวิร์ดมีเครื่องหมาย
tr: İşaretli sözcükler
uk: Слова зі знаком
vi: Word có dấu
zh_hans: 有符号字
zh_hant: 帶正負號的字組

# Hash_Key
source: Key (hex)
ar: المفتاح (hex)
cs: Klíč (Hex)
de: Schlüssel (hex)
el: Κλειδί (hex)
es: Clave (hex)
fa: کلید (hex)
fr: Clé (hex)
hu: Kulcs (Hex)
id: Kunci (hex)
it: Chiave (hex)
ja: 鍵 (Hex)
ko: 키(Hex)
pl: Klucz (hex)
pt: Chave (hex)
ro: Cheie (Hex)
th: คีย์ (ฐานสิบหก)
tr: Anahtar (hex)
uk: Ключ (hex)
vi: Khóa (hex)
zh_hans: 密钥 (Hex)
zh_hant: 金鑰（Hex）

# Hash_KeyPlaceholder
source: None
ar: بلا
cs: Žádný
de: Keiner
el: Κανένα
es: Ninguna
fa: هیچ
fr: Aucune
hu: Nincs
id: Tidak ada
it: Nessuna
ja: なし
ko: 없음
pl: Brak
pt: Nenhuma
ro: Niciuna
th: ไม่มี
tr: Yok
uk: Немає
vi: Không
zh_hans: 无
zh_hant: 無

# Hash_KeyInvalid
source: Enter the key as hex digits (an even number).
ar: أدخل المفتاح كأرقام hex (عدد زوجي).
cs: Zadejte klíč jako šestnáctkové číslice (sudý počet).
de: Geben Sie den Schlüssel als Hex-Ziffern ein (gerade Anzahl).
el: Εισαγάγετε το κλειδί ως δεκαεξαδικά ψηφία (άρτιος αριθμός).
es: Escribe la clave como dígitos Hex (un número par).
fa: کلید را به‌صورت ارقام hex (تعداد زوج) وارد کنید.
fr: Entrez la clé en chiffres Hex (nombre pair).
hu: Adja meg a kulcsot hexadecimális számjegyekkel (páros számú).
id: Masukkan kunci sebagai digit hex (jumlah genap).
it: Immetti la chiave come cifre esadecimali (in numero pari).
ja: 鍵は偶数桁の Hex で入力してください。
ko: 키를 Hex 숫자(짝수 자릿수)로 입력하세요.
pl: Wprowadź klucz jako cyfry szesnastkowe (parzysta liczba).
pt: Insira a chave como dígitos hexadecimais (em número par).
ro: Introduceți cheia ca cifre hexazecimale (un număr par).
th: ป้อนคีย์เป็นเลขฐานสิบหก (จำนวนหลักเป็นเลขคู่)
tr: Anahtarı onaltılık basamaklar olarak girin (çift sayıda).
uk: Введіть ключ шістнадцятковими цифрами (парна кількість).
vi: Hãy nhập khóa dưới dạng chữ số hex (số chữ số chẵn).
zh_hans: 请以 Hex 数字输入密钥（偶数位）。
zh_hant: 請以十六進位數字（偶數位數）輸入金鑰。

# Hash_OutputBits
source: Output length (bits)
ar: طول الإخراج (بت)
cs: Délka výstupu (bity)
de: Ausgabelänge (Bits)
el: Μήκος εξόδου (bit)
es: Longitud de salida (bits)
fa: طول خروجی (بیت)
fr: Longueur de sortie (bits)
hu: Kimeneti hossz (bit)
id: Panjang output (bit)
it: Lunghezza output (bit)
ja: 出力長 (bit)
ko: 출력 길이(비트)
pl: Długość wyniku (bity)
pt: Comprimento da saída (bits)
ro: Lungime de ieșire (biți)
th: ความยาวเอาต์พุต (บิต)
tr: Çıktı uzunluğu (bit)
uk: Довжина результату (біти)
vi: Độ dài đầu ra (bit)
zh_hans: 输出长度（位）
zh_hant: 輸出長度（位元）

# Hash_OutputBitsInvalid
source: Enter the output length in bits.
ar: أدخل طول الإخراج بالبتات.
cs: Zadejte délku výstupu v bitech.
de: Geben Sie die Ausgabelänge in Bits ein.
el: Εισαγάγετε το μήκος εξόδου σε bit.
es: Escribe la longitud de salida en bits.
fa: طول خروجی را به بیت وارد کنید.
fr: Entrez la longueur de sortie en bits.
hu: Adja meg a kimeneti hosszt bitekben.
id: Masukkan panjang output dalam bit.
it: Immetti la lunghezza dell'output in bit.
ja: 出力長をビット数で入力してください。
ko: 출력 길이를 비트 단위로 입력하세요.
pl: Wprowadź długość wyniku w bitach.
pt: Insira o comprimento da saída em bits.
ro: Introduceți lungimea de ieșire în biți.
th: ป้อนความยาวเอาต์พุตเป็นบิต
tr: Çıktı uzunluğunu bit olarak girin.
uk: Введіть довжину результату в бітах.
vi: Hãy nhập độ dài đầu ra theo bit.
zh_hans: 请以位为单位输入输出长度。
zh_hant: 請以位元為單位輸入輸出長度。

# Hash_Ed2k
source: Exact multiples of 9,728,000 bytes
ar: المضاعفات التامة لـ 9,728,000 بايت
cs: Přesné násobky 9 728 000 bajtů
de: Genaue Vielfache von 9.728.000 Bytes
el: Ακριβή πολλαπλάσια των 9.728.000 byte
es: Múltiplos exactos de 9 728 000 bytes
fa: مضرب‌های دقیق 9,728,000 بایت
fr: Multiples exacts de 9 728 000 octets
hu: 9 728 000 bájt pontos többszörösei
id: Kelipatan tepat 9.728.000 byte
it: Multipli esatti di 9.728.000 byte
ja: 9,728,000 バイトの倍数のときの扱い
ko: 9,728,000바이트의 정확한 배수
pl: Dokładne wielokrotności 9 728 000 bajtów
pt: Múltiplos exatos de 9.728.000 bytes
ro: Multipli exacți de 9.728.000 de octeți
th: ผลคูณพอดีของ 9,728,000 ไบต์
tr: 9.728.000 baytın tam katları
uk: Точно кратно 9 728 000 байтів
vi: Bội số chính xác của 9.728.000 byte
zh_hans: 恰好为 9,728,000 字节的倍数时
zh_hant: 剛好是 9,728,000 個位元組的倍數時

# Hash_Ed2k_Blue
source: New method (blue)
ar: الطريقة الجديدة (blue)
cs: Nová metoda (blue)
de: Neue Methode (blue)
el: Νέα μέθοδος (blue)
es: Método nuevo (blue)
fa: روش جدید (blue)
fr: Nouvelle méthode (blue)
hu: Új módszer (blue)
id: Metode baru (blue)
it: Nuovo metodo (blu)
ja: 新方式 (blue)
ko: 새 방식(blue)
pl: Nowa metoda (niebieska)
pt: Método novo (azul)
ro: Metoda nouă (blue)
th: วิธีใหม่ (blue)
tr: Yeni yöntem (mavi)
uk: Новий метод (синій)
vi: Phương pháp mới (blue)
zh_hans: 新方法 (blue)
zh_hant: 新方式（blue）

# Hash_Ed2k_Red
source: Old method (red)
ar: الطريقة القديمة (red)
cs: Stará metoda (red)
de: Alte Methode (red)
el: Παλιά μέθοδος (red)
es: Método antiguo (red)
fa: روش قدیمی (red)
fr: Ancienne méthode (red)
hu: Régi módszer (red)
id: Metode lama (red)
it: Vecchio metodo (rosso)
ja: 旧方式 (red)
ko: 이전 방식(red)
pl: Stara metoda (czerwona)
pt: Método antigo (vermelho)
ro: Metoda veche (red)
th: วิธีเก่า (red)
tr: Eski yöntem (kırmızı)
uk: Старий метод (червоний)
vi: Phương pháp cũ (red)
zh_hans: 旧方法 (red)
zh_hant: 舊方式（red）

# HashWrite_Title
source: Write hash value at cursor
ar: كتابة قيمة التجزئة عند المؤشر
cs: Zapsat hodnotu hash na pozici kurzoru
de: Hashwert am Cursor schreiben
el: Εγγραφή τιμής κατακερματισμού στη θέση του δρομέα
es: Escribir el valor hash en el cursor
fa: نوشتن مقدار هش در محل مکان‌نما
fr: Écrire la valeur de hachage au curseur
hu: Kivonatérték írása a kurzorhoz
id: Tulis nilai hash di kursor
it: Scrivi valore hash al cursore
ja: カーソル位置に書き込む
ko: 커서 위치에 해시 값 쓰기
pl: Zapisz wartość skrótu w miejscu kursora
pt: Gravar valor de hash no cursor
ro: Scriere valoare hash la cursor
th: เขียนค่าแฮชที่เคอร์เซอร์
tr: Karma değerini imlece yaz
uk: Запис хеш-значення в позицію курсора
vi: Ghi giá trị hash tại con trỏ
zh_hans: 在光标处写入哈希值
zh_hant: 在游標處寫入雜湊值

# HashWrite_Write
source: Write
ar: كتابة
cs: Zapsat
de: Schreiben
el: Εγγραφή
es: Escribir
fa: نوشتن
fr: Écrire
hu: Írás
id: Tulis
it: Scrivi
ja: 書き込む
ko: 쓰기
pl: Zapisz
pt: Gravar
ro: Scriere
th: เขียน
tr: Yaz
uk: Записати
vi: Ghi
zh_hans: 写入
zh_hant: 寫入

# HashWrite_Row
source: Value
ar: القيمة
cs: Hodnota
de: Wert
el: Τιμή
es: Valor
fa: مقدار
fr: Valeur
hu: Érték
id: Nilai
it: Valore
ja: 書き込む値
ko: 값
pl: Wartość
pt: Valor
ro: Valoare
th: ค่า
tr: Değer
uk: Значення
vi: Giá trị
zh_hans: 值
zh_hant: 值

# HashWrite_Position
source: Overwrites from offset {0}.
ar: يكتب فوق البيانات بدءًا من الإزاحة {0}.
cs: Přepíše data od posunu {0}.
de: Überschreibt ab Offset {0}.
el: Αντικαθιστά από τη μετατόπιση {0}.
es: Sobrescribe a partir del desplazamiento {0}.
fa: از آفست {0} بازنویسی می‌کند.
fr: Remplace à partir du décalage {0}.
hu: Felülírás a(z) {0} eltolástól.
id: Menimpa mulai dari offset {0}.
it: Sovrascrive a partire dall'offset {0}.
ja: オフセット {0} から上書きします。
ko: 오프셋 {0}부터 덮어씁니다.
pl: Nadpisuje od przesunięcia {0}.
pt: Substitui a partir do deslocamento {0}.
ro: Suprascrie începând de la deplasamentul {0}.
th: เขียนทับตั้งแต่ออฟเซ็ต {0}
tr: {0} ofsetinden itibaren üzerine yazar.
uk: Замінює дані, починаючи зі зміщення {0}.
vi: Ghi đè từ độ lệch {0}.
zh_hans: 从偏移量 {0} 开始改写。
zh_hant: 從位移 {0} 開始覆寫。

# HashWrite_BigEndian
source: Big endian (as the number is written)
ar: Big-endian (كما يُكتب الرقم)
cs: Big-endian (jak se číslo zapisuje)
de: Big-Endian (wie die Zahl geschrieben wird)
el: Big-endian (όπως γράφεται ο αριθμός)
es: Big-endian (como se escribe el número)
fa: Big-endian (همان‌طور که عدد نوشته می‌شود)
fr: Gros-boutiste (dans l'ordre d'écriture du nombre)
hu: Big-endian (ahogy a szám le van írva)
id: Big-endian (seperti angka ditulis)
it: Big-endian (come viene scritto il numero)
ja: ビッグエンディアン (数値の表記の順)
ko: 빅 엔디언(숫자 표기 순서)
pl: Big-endian (tak jak zapisana jest liczba)
pt: Big-endian (como o número é escrito)
ro: Big-endian (cum este scris numărul)
th: Big-endian (ตามที่เขียนตัวเลข)
tr: Big-endian (sayının yazıldığı gibi)
uk: Big-endian (як записується число)
vi: Big-endian (như cách viết số)
zh_hans: 大端序（与数字的书写顺序相同）
zh_hant: 大端序（依數字的書寫順序）

# HashWrite_LittleEndian
source: Little endian (least significant byte first)
ar: Little-endian (البايت الأدنى أهمية أولاً)
cs: Little-endian (nejnižší bajt první)
de: Little-Endian (niederwertigstes Byte zuerst)
el: Little-endian (πρώτα το λιγότερο σημαντικό byte)
es: Little-endian (byte menos significativo primero)
fa: Little-endian (ابتدا کم‌ارزش‌ترین بایت)
fr: Petit-boutiste (octet de poids faible en premier)
hu: Little-endian (legalacsonyabb helyiértékű bájt elöl)
id: Little-endian (byte paling tidak signifikan dahulu)
it: Little-endian (prima il byte meno significativo)
ja: リトルエンディアン (下位のバイトから)
ko: 리틀 엔디언(최하위 바이트부터)
pl: Little-endian (najpierw najmniej znaczący bajt)
pt: Little-endian (byte menos significativo primeiro)
ro: Little-endian (întâi octetul cel mai puțin semnificativ)
th: Little-endian (ไบต์ที่มีนัยสำคัญน้อยที่สุดก่อน)
tr: Little-endian (önce en az anlamlı bayt)
uk: Little-endian (спочатку молодший байт)
vi: Little-endian (byte thấp nhất trước)
zh_hans: 小端序（最低有效字节在前）
zh_hant: 小端序（最低有效位元組在前）
